Autodesk.Revit.DB.ExternallyTaggedNonBReps.Add(Autodesk.Revit.DB.AugmentationGeometryObject)
Adds a copy of the input AugmentationGeometryObject to this collection.
geometry:
The AugmentationGeometryObject to be added.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ExternalGeometryId of geometry already exists in this collection.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.ExternallyTaggedNonBReps.CanAddAugmentationGeometryObject(Autodesk.Revit.DB.AugmentationGeometryObject)
Checks if the input geometry could be added to this collection or not.
Remarks:
Duplicate ExternalGeometryIds are prohibited.
Returns:
True if we can add the input geometry to this collection, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.ExternallyTaggedNonBReps.Add(Autodesk.Revit.DB.ExternallyTaggedNonBRep)
Adds a copy of the input ExternallyTaggedNonBRep to this collection.
geometry:
The ExternallyTaggedNonBRep to be added.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ExternalGeometryId of geometry already exists in this collection.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.ExternallyTaggedNonBReps.CanAddExternallyTaggedNonBRep(Autodesk.Revit.DB.ExternallyTaggedNonBRep)
Checks if the input geometry could be added to this collection or not.
Remarks:
Duplicate ExternalGeometryIds are prohibited.
Returns:
True if we can add the input geometry to this collection, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.ExternallyTaggedNonBReps.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ExternallyTaggedNonBReps.#ctor
Make a new empty collection of ExternallyTaggedNonBRep instances.
Since:
2024

Autodesk.Revit.DB.ExternallyTaggedNonBReps
Holds a collection of ExternallyTaggedNonBRep instances.
Since:
2024